# LEETCODE
## Problem-175: Combine Two tables
Source: https://leetcode.com/problems/combine-two-tables/

Table: Person
| Column Name | Type    |
|-------------|---------|
| personId    | int     |
| lastName    | varchar |
| firstName   | varchar |

personId is the primary key column for this table.
This table contains information about the ID of some persons and their first and last names.

 Table: Address
| Column Name | Type    |
|-------------|---------|
| addressId   | int     |
| personId    | int     |
| city        | varchar |
| state       | varchar |

addressId is the primary key column for this table.
Each row of this table contains information about the city and state of one person with ID = PersonId.

## To Do:
Write an SQL query to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

The query result format is in the following example. 

Example 1:

Input: 

Person table:
| personId | lastName | firstName |
|----------|----------|-----------|
| 1        | Wang     | Allen     |
| 2        | Alice    | Bob       |

Address table:
| addressId | personId | city          | state      |
|-----------|----------|---------------|------------|
| 1         | 2        | New York City | New York   |
| 2         | 3        | Leetcode      | California |

Output: 
| firstName | lastName | city          | state    |
|-----------|----------|---------------|----------|
| Allen     | Wang     | Null          | Null     |
| Bob       | Alice    | New York City | New York |

Explanation: 
There is no address in the address table for the personId = 1 so we return null in their city and state.
addressId = 1 contains information about the address of personId = 2.

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
# Creating the Person table
person_data = [
    (1, 'Wang', 'Allen'),
    (2, 'Alice', 'Bob')
]

person_columns = ['personId', 'lastName', 'firstName']

# Creating the Address table
address_data = [
    (1, 2, 'New York City', 'New York'),
    (2, 3, 'Leetcode', 'California')
]

address_columns = ['addressId', 'personId', 'city', 'state']

# Creating pandas DataFrames
person_df = pd.DataFrame(person_data, columns=person_columns)
address_df = pd.DataFrame(address_data, columns=address_columns)

In [3]:
person_df

   personId lastName firstName
0         1     Wang     Allen
1         2    Alice       Bob

In [4]:
address_df

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

## Task

In [5]:
# Define the SQL query
query = """
Select firstName, LastName, city, state
FROM Person
LEFT JOIN Address USING(personID);
"""

# Excute the SQL query using pandasql
result = sqldf(query, env={'Person':person_df, 'Address':address_df})

# Print the results dataframe
display(result)

  firstName lastName           city     state
0     Allen     Wang           None      None
1       Bob    Alice  New York City  New York